HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxCpu_reg.h
/** Alias (User Manual Name) for CPU1_TR4_ADR.
* To use register names with standard convension, please use CPU1_TR4_ADR.
*/
#define	CPU1_TR4ADR	(CPU1_TR4_ADR)

/** \\brief  F020, Trigger Event */
#define CPU1_TR4_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF883F020u)

/** Alias (User Manual Name) for CPU1_TR4_EVT.
* To use register names with standard convension, please use CPU1_TR4_EVT.
*/
#define	CPU1_TR4EVT	(CPU1_TR4_EVT)

/** \\brief  F02C, Trigger Address */
#define CPU1_TR5_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF883F02Cu)

/** Alias (User Manual Name) for CPU1_TR5_ADR.
* To use register names with standard convension, please use CPU1_TR5_ADR.
*/
#define	CPU1_TR5ADR	(CPU1_TR5_ADR)

/** \\brief  F028, Trigger Event */
#define CPU1_TR5_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF883F028u)

/** Alias (User Manual Name) for CPU1_TR5_EVT.
* To use register names with standard convension, please use CPU1_TR5_EVT.
*/
#define	CPU1_TR5EVT	(CPU1_TR5_EVT)

/** \\brief  F034, Trigger Address */
#define CPU1_TR6_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF883F034u)

/** Alias (User Manual Name) for CPU1_TR6_ADR.
* To use register names with standard convension, please use CPU1_TR6_ADR.
*/
#define	CPU1_TR6ADR	(CPU1_TR6_ADR)

/** \\brief  F030, Trigger Event */
#define CPU1_TR6_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF883F030u)

/** Alias (User Manual Name) for CPU1_TR6_EVT.
* To use register names with standard convension, please use CPU1_TR6_EVT.
*/
#define	CPU1_TR6EVT	(CPU1_TR6_EVT)

/** \\brief  F03C, Trigger Address */
#define CPU1_TR7_ADR /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_ADR*)0xF883F03Cu)

/** Alias (User Manual Name) for CPU1_TR7_ADR.
* To use register names with standard convension, please use CPU1_TR7_ADR.
*/
#define	CPU1_TR7ADR	(CPU1_TR7_ADR)

/** \\brief  F038, Trigger Event */
#define CPU1_TR7_EVT /*lint --e(923)*/ (*(volatile Ifx_CPU_TR_EVT*)0xF883F038u)

/** Alias (User Manual Name) for CPU1_TR7_EVT.
* To use register names with standard convension, please use CPU1_TR7_EVT.
*/
#define	CPU1_TR7EVT	(CPU1_TR7_EVT)

/** \\brief  FD30, CPU Trigger Address x */
#define CPU1_TRIG_ACC /*lint --e(923)*/ (*(volatile Ifx_CPU_TRIG_ACC*)0xF883FD30u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Cpu_Cfg_Cpu2
 * \{  */

/** \\brief  FF80, Address General Purpose Register */
#define CPU2_A0 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FF80u)

/** \\brief  FF84, Address General Purpose Register */
#define CPU2_A1 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FF84u)

/** \\brief  FFA8, Address General Purpose Register */
#define CPU2_A10 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FFA8u)

/** \\brief  FFAC, Address General Purpose Register */
#define CPU2_A11 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FFACu)

/** \\brief  FFB0, Address General Purpose Register */
#define CPU2_A12 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FFB0u)

/** \\brief  FFB4, Address General Purpose Register */
#define CPU2_A13 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FFB4u)

/** \\brief  FFB8, Address General Purpose Register */
#define CPU2_A14 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FFB8u)

/** \\brief  FFBC, Address General Purpose Register */
#define CPU2_A15 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FFBCu)

/** \\brief  FF88, Address General Purpose Register */
#define CPU2_A2 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FF88u)

/** \\brief  FF8C, Address General Purpose Register */
#define CPU2_A3 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FF8Cu)

/** \\brief  FF90, Address General Purpose Register */
#define CPU2_A4 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FF90u)

/** \\brief  FF94, Address General Purpose Register */
#define CPU2_A5 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FF94u)

/** \\brief  FF98, Address General Purpose Register */
#define CPU2_A6 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FF98u)

/** \\brief  FF9C, Address General Purpose Register */
#define CPU2_A7 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FF9Cu)

/** \\brief  FFA0, Address General Purpose Register */
#define CPU2_A8 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FFA0u)

/** \\brief  FFA4, Address General Purpose Register */
#define CPU2_A9 /*lint --e(923)*/ (*(volatile Ifx_CPU_A*)0xF885FFA4u)

/** \\brief  FE20, Base Interrupt Vector Table Pointer */
#define CPU2_BIV /*lint --e(923)*/ (*(volatile Ifx_CPU_BIV*)0xF885FE20u)

/** \\brief  FE24, Base Trap Vector Table Pointer */
#define CPU2_BTV /*lint --e(923)*/ (*(volatile Ifx_CPU_BTV*)0xF885FE24u)

/** \\brief  FC04, CPU Clock Cycle Count */
#define CPU2_CCNT /*lint --e(923)*/ (*(volatile Ifx_CPU_CCNT*)0xF885FC04u)

/** \\brief  FC00, Counter Control */
#define CPU2_CCTRL /*lint --e(923)*/ (*(volatile Ifx_CPU_CCTRL*)0xF885FC00u)

/** \\brief  9400, Compatibility Control Register */
#define CPU2_COMPAT /*lint --e(923)*/ (*(volatile Ifx_CPU_COMPAT*)0xF8859400u)

/** \\brief  FE1C, CPU Core Identification Register */
#define CPU2_CORE_ID /*lint --e(923)*/ (*(volatile Ifx_CPU_CORE_ID*)0xF885FE1Cu)

/** \\brief  D000, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR0_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D000u)

/** \\brief  D004, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR0_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D004u)

/** \\brief  D008, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR1_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D008u)

/** \\brief  D00C, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR1_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D00Cu)

/** \\brief  D010, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR2_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D010u)

/** \\brief  D014, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR2_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D014u)

/** \\brief  D018, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR3_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D018u)

/** \\brief  D01C, CPU Code Protection Range Upper Bound Register */
#define CPU2_CPR3_U /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D01Cu)

/** \\brief  D020, CPU Code Protection Range Lower Bound Register */
#define CPU2_CPR4_L /*lint --e(923)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D020u)

